app/controllers/api/swaps_controller.rb

SELECT "swap_tickets".* FROM "swap_tickets" ORDER BY "swap_tickets"."id" ASC LIMIT ?  [["LIMIT", 25]]
---
  def index
    swaps = SwapTicket.all.order(created_at: :desc).limit(50)
    render json: swaps.map { |s|

SELECT "devices".* FROM "devices" WHERE "devices"."device_id" = ? AND "devices"."vendor" = ? LIMIT ?  [["device_id", 6001], ["vendor", "Juniper"], ["LIMIT", 1]]
INSERT INTO "swap_tickets" ("assigned_tech_id", "assigned_tech_type", "created_at", "device_id", "scheduled_at", "status", "updated_at", "site_id", "vendor", "notes", "tech_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    device = Device.find_or_create_by!(device_id: params[:device_id], vendor: params[:vendor])
    site = Site.find_or_create_by!(name: 'Phoenix DC21', code: 'PHX21')

    swap = SwapTicket.create!(
      device: device, site: site, vendor: params[:vendor] || 'Cisco',
      status: 'scheduled', assigned_tech_id: 1, scheduled_at: 1.hour.from_now
    )

SELECT "swap_tickets".* FROM "swap_tickets" WHERE "swap_tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "swap_tickets" SET "status" = ?, "assigned_tech_id" = ?, "updated_at" = ? WHERE "swap_tickets"."id" = ?  [["status", "2"], ["assigned_tech_id", 1], ["updated_at", "2026-02-12 02:36:54.538239"], ["id", 2001]]
---
  def claim
    swap = SwapTicket.find(params[:id])
    old_status = swap.status
    swap.update!(assigned_tech_id: 1, status: 'claimed')  # Smith,J. ID=1